{
  "word_to_idx": {
    "<PAD>": 0,
    "<START>": 1,
    "<END>": 2,
    "<UNK>": 3,
    "extra": 4,
    "large": 5,
    "gray": 6,
    "fabric": 7,
    "glove": 8,
    "with": 9,
    "plain": 10,
    "pattern,": 11,
    "no": 12,
    "visible": 13,
    "damage.": 14,
    "white": 15,
    "knitted": 16,
    "glove,": 17,
    "size": 18,
    "large,": 19,
    "featuring": 20,
    "dotted": 21,
    "design,": 22,
    "medium": 23,
    "sized": 24,
    "made": 25,
    "of": 26,
    "knitted,": 27,
    "patterned": 28,
    "texture,": 29,
    "in": 30,
    "color,": 31,
    "size,": 32,
    "textured": 33,
    "finish,": 34,
    "small": 35,
    "medium,": 36,
    "blue": 37,
    "fabric,": 38,
    "brown": 39,
    "small,": 40,
    "leather,": 41,
    "green": 42,
    "rubber": 43,
    "black": 44,
    "some": 45,
    "marks.": 46,
    "leather": 47,
    "red": 48,
    "orange": 49,
    "multiple": 50,
    "marks": 51,
    "or": 52,
    "stains.": 53,
    "pink": 54,
    "yellow": 55,
    "rubber,": 56
  },
  "idx_to_word": {
    "0": "<PAD>",
    "1": "<START>",
    "2": "<END>",
    "3": "<UNK>",
    "4": "extra",
    "5": "large",
    "6": "gray",
    "7": "fabric",
    "8": "glove",
    "9": "with",
    "10": "plain",
    "11": "pattern,",
    "12": "no",
    "13": "visible",
    "14": "damage.",
    "15": "white",
    "16": "knitted",
    "17": "glove,",
    "18": "size",
    "19": "large,",
    "20": "featuring",
    "21": "dotted",
    "22": "design,",
    "23": "medium",
    "24": "sized",
    "25": "made",
    "26": "of",
    "27": "knitted,",
    "28": "patterned",
    "29": "texture,",
    "30": "in",
    "31": "color,",
    "32": "size,",
    "33": "textured",
    "34": "finish,",
    "35": "small",
    "36": "medium,",
    "37": "blue",
    "38": "fabric,",
    "39": "brown",
    "40": "small,",
    "41": "leather,",
    "42": "green",
    "43": "rubber",
    "44": "black",
    "45": "some",
    "46": "marks.",
    "47": "leather",
    "48": "red",
    "49": "orange",
    "50": "multiple",
    "51": "marks",
    "52": "or",
    "53": "stains.",
    "54": "pink",
    "55": "yellow",
    "56": "rubber,"
  },
  "vocab_size": 57
}